using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Dentistry
{
    class UserInfoAddClass
    {
        public string AboutSoft { get; } = "Dentistry це програма для Windows - надійний інструмент для роботи зі стоматологіями." +
                "\n\nDentistry для Windows доступний в одному варіанті \n\nDentistry.exe - версія з графічним інтерфейсом(GUI);" +
                "\n\nDentistry і модулі самі розпаковуються \n\nDentistry працюють в середовищі Windows XP SP3 і новіше.";
        public string AboutInterface { get; } = "В цьому розділі коротко описані основні частини інтерфейса Dentistry." +
                "\n\n Меню Dentistry має настуані пункти: \"Головна\",\n\"Справка\", \"Допомога\"." +
                "\n Пункт \"Головна\" включає в себе два підпункта: \"Налаштування\" - що " +
                "служить для вибору або редагування шляху до бази даних та программи для віддаленої допомоги TeamViewer," +
                " та \"Вихід\" - кнопка для виходу з программи." +
                "\n Пункт \"Справка\" включає в себе два підпункти: \"Посібник користувача\" - що є" +
                "головним пунктом для новачків в користуванні програмою Dentistry та пункт \"Про программу\" - форма в якій вказано " +
                "головні відомості по технічній частині программи такі як назва, версія та інформація про розробника. " +
                "\n Пункт \"Допомога\" включає в себе два підпункти: \"Контакти\" - де вказані " +
                "контакти про розробника та шляхи по яким можна з'вязатися з розробником, та \"Віддалена допомога\" " +
                " - включає в собі можливість з'вязатися з розробником за попереднім звінком та вказаним шляхом до TeamViewer." +
                "\n\nРобоча частина програми є головним полем для взаємодії з користувачем. " +
                "\n\n\tЛіва половина поля" +
                " включає в собі дві кнопки: \"Додати нового паціента\" та \"Редагувати паціента\" " +
                "і таблиця на якій відображаються всі паціенти які коли-небуть були внесені в базу та відвідували ваш заклад. " +
                "Таблиця служить для того щоб переглянути інформацію про паціента та надає можливість переглянути всі прийоми " +
                "даного паціента по датам при виборі." +
                "\n\n\t Права половина поля включає в собі також дві кнопки: \"Додати новий прийом\" та \"Оновити дані\" " +
                "і панель яка дозволяє редагувати паціента.";
        public string AboutSettings { get; } = "Шлях до БД (База Даних) - для того щоб вказати шлях до бази даних зробіть подвійне натискання на ЛКМ (Ліва Кнопка Мишки), після того як відкриється вікно вибору шляху," +
                "перейдіть до папки у якій у вас знаходить \".mdf\" файл, виберіть його та нажміть кнопку \"ОК\" для того щоб підтвердити ваш вибір. Шлях до БД обов'язково потрібно " +
                "вказати для того щоб у вас був доступ до башої бази даних та ви могли з нею працювати!" +
                "\n\nШлях до TV (TeamViewer) - для того щоб вказати шлях до TeamViewer зробіть подвійне натискання на ЛКМ (Ліва Кнопка Мишки), після того як відкриється вікно вибору шляху," +
                "перейдіть до папки у якій у вас знаходить \"TeamViewer.exe\" , виберіть його та нажміть кнопку \"ОК\" для того щоб підтвердити ваш вибір. Шлях до TV не обов'язковий для" +
                " вказення, його також можна ввести після запуску програми в пункті \"Головна\" -> \"Налаштування\". Але ми рекомендуємо вам встановити шлях відпразу,щоб программа" +
                "запускалася віздразу з головного меню а не з Налаштувань, та для того щоб в майбутьньому " +
                "у вас була можливість зв'язатися з нами.";
    }
}
